benchmark/report/rps/full/20260804_160121/raw/010_auth_me_c100_r1.txt
Running 20s test @ http://127.0.0.1:32778/api/auth/me
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   126.24ms    7.13ms 150.71ms   98.49%
    Req/Sec    95.16     29.18   240.00     80.79%
  Latency Distribution
     50%  126.67ms
     75%  127.62ms
     90%  128.59ms
     99%  131.87ms
  15200 requests in 20.07s, 10.41MB read
Requests/sec:    757.34
Transfer/sec:    531.02KB
HPS_WRK_REQUESTS 15200
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 15200
HPS_STATUS_2XX 15200
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=15200