benchmark/report/rps/full/20260804_160121/raw/035_download_1mb_c50_r1.txt
Running 20s test @ http://127.0.0.1:32778/api/files/by-hash/85a8c17d8f1d86f4cb48e48c18509120decda2f8766ded02ac769e439b42b761/download
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   627.80ms  101.72ms 952.00ms   69.67%
    Req/Sec    10.86      6.45    40.00     65.56%
  Latency Distribution
     50%  628.08ms
     75%  694.82ms
     90%  753.21ms
     99%  857.16ms
  1507 requests in 20.10s, 1.47GB read
Requests/sec:     74.98
Transfer/sec:     75.02MB
HPS_WRK_REQUESTS 1507
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 1507
HPS_STATUS_2XX 1507
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=1507